// Написать программу, которая на вход принимает число и выдаёт его квадрат
Console.Write("Введите число: ");
int InputNumber = Convert.ToInt32(Console.ReadLine());
Console.Write("Квадрат числа " + InputNumber + " равен " + InputNumber * InputNumber);
